{"meta":{"title":null,"subtitle":null,"description":"This is a website for my class Fundamentals of Interactive Design at Seminole State College.","author":"Ray Villalobos","url":"http://yoursite.com/fid"},"pages":[{"title":"","date":"2018-01-12T23:00:43.186Z","updated":"2018-01-12T01:46:01.656Z","comments":true,"path":"slides/09_socialmedia.html","permalink":"http://yoursite.com/fid/slides/09_socialmedia.html","excerpt":"","text":""},{"title":"","date":"2018-01-12T23:00:41.419Z","updated":"2018-01-12T01:46:01.652Z","comments":true,"path":"slides/01a_the_internet_and_urls.html","permalink":"http://yoursite.com/fid/slides/01a_the_internet_and_urls.html","excerpt":"","text":"How the internet works Client makes a request to a server. The server routes the request to a service Server sends data back to client Teacher’s Notes: Before we get started, let’s talk a bit about how the internet works. You probably already know generally speaking how it works, but I think it would help to cover more specifically what it’s doing in the background First There’s two types of computers on the internet…clients and servers. Any computer can behave as a client or a server. A client is the computer that makes requests for information to a server. The server has special software installed that sends the request for the information to a service. That’s usually some application that does something with the requests. You could be requesting a webpage, or an email. The server will analyze the request and then send it to the appropriate application to process. Finally, once the server finishes requesting the information, it’s sent back to the client as a webpage, an email, or whatever. Internet Protocols Communication happens through protocols Various server apps handle different protocols http, pop, smtp, ftp, https Author’s Notes On the internet, communication happens through protocols. If you’ve seen Star Wars you might remember that C3-PO is a protocol droid and that he got hired by Luke’s uncle because he spoke the language of moisture vaporators. The internet is a bit like that, in order to get things done, you have to be able to communicate in different languages. Each service has it’s own language or ‘protocol’. When requests are made to the server, they happen in these different languages. By far, the most common protocol is http. You usually see it typed at the beginning of a web address, but there are others like pop and smtp for mail, ftp for file transfers and https for secure web connections. Uniform Resource Locatorhttps://www.youtube.com/watch?v=MspVCc0_R3g&amp;t=37s#top The initial request/command Author’s Notes: You might be asking how the server knows what to do. The key to that magic is the URL or Uniform Resource Locator. You’re probably used to seeing the on the web. They have all the information the server needs to do it’s job. This is a pretty complex looking URL, but it’s divided into several different parts and it’s important that you understand how these work. Note: Sometimes the server will have a shortened version of this without all of the information to make it easier to read. Protocolhttps://www.youtube.com/watch?v=MspVCc0_R3g&amp;t=37s#top Language of the request http vs https Author’s Notes The first piece of the request is the protocol. This is the main thing the server needs to know, so that it can send the request to the proper service or application. Here, it’s https, because it’s an http request that’s a bit more secure. Most modern sites today use https instead of http because it’s a more secure version in which pages are sent encrypted. Subdomainhttps:// www .youtube.com/watch?v=MspVCc0_R3g&amp;t=37s#top Domain inside domain Helps you divide requests Author’s Notes Servers have a lot of ways to divide requests and one of the ways you can do that is by using a sub-domain. A sub-domain allows the same domain to do multiple jobs. It’s like having a website inside another website. You’ve probably noticed that most websites have a www. subdomain, but there can be others, so for example, you can go www.google.com for web searches, images.google.com to do image specific searches or mail.google.com to use your google email. Domainhttps://www. youtube .com/watch?v=MspVCc0_R3g&amp;t=37s#top The location of a service on the internet Converted to IP addresses by DNS Servers IP addresses = Zip Codes DNS Servers = Post Office Author’s Notes The next part of the URL is what most people associate with a website and it’s called the domain name. Have you ever asked yourself how your browser knows where to find a website? It happens because of the domain name. This name is associated with a series of numbers called IP addresses on the internet. The fact that it is a name is a convenience for humans because it would be too hard to remember all of the numbers everytime we went to a website. An IP address is like a phone number or zip code, it represents the physical location of the server on the internet. The names and numbers are stored through a sub-network inside the internet called DNS or Domain Name Servers. They act as an index or phone book of the names and IP addresses. Think of DNS servers as the Post Office, by reading the zip code, they know the part of the country you live in and can route the mail to the appropriate location. Top Level Domainshttps://www.youtube. com /watch?v=MspVCc0_R3g&amp;t=37s#top Domain type .com, .net, org, .gov, .edu Country specific Monopo.ly Instagr.am Very flexible today Author’s Notes The next part is the TLD or Top Level Domain. It represents the domain type and is supposed to identify the type of domain that you’re using. The most common types are .com for companies, .net for internet service providers, .org for non-profit entities, .gov for government organizations and .edu for educational organizations. In reality the requirement that the TLDs match function hasn’t been enforced and has been removed. .com is by far the most common and most people will try to use a .com TLD before they use anything else. In addition to that every country as assigned it’s own TLD. Those are usually two letters long, so for example .co is for colombia, .ly is for lybia and .am is for amsterdam. A lot of people use these to make interesting URLs, so for example many tech companies use the .io (British Indian Ocean Territory) TLD for web applications like atom.io. Most of the time country specific TLDs are a bit more expensive. In recent years, the amount of TLDs has exploded into many other categories, which include things like .dad, .biz, .info, .mobi, etc. Port Numberhttps://www.youtube.com :8707 /watch?v=MspVCc0_R3g&amp;t=37s#top A way to divide app requests Request sent through ports Author’s Notes Another thing you might see on a URL as a way to further divide app requests is something called a port number It follows the TLD and starts with a colon and has a number. Think of this as channels on radio or TV. They allow you to send different types of information on the same domain or subdomain. When you request web pages, they are sent through one of these channels, although most of the time you won’t see these or deal with them. You may see these when setting up FTP, mail or some advanced web projects. Pathhttps://www.youtube.com /watch ?v=MspVCc0_R3g&amp;t=37s#top The App, page, file or service you want Often a folder/file structure Can be data passed Author’s Notes Next is the path of the request. This is separated by slashes / and let the server know the location of the service you’re requesting. They can be setup in a couple of ways. One way is to set it up to represent the directory location of the file you need. So for example, we could assume that watch specified in a youtube request represents the name of a folder in the server hosting the google application. If there was a file called video.mp4 then the path might be /watch/video.mp4. This isn’t the way YouTube or some other service works though, they use the PATHS as information passed to the server. The current way of managing URLs can also be written like this: https://www.youtube.com/watch?v=MspVCc0_R3g&amp;t=37s#top Query/Parametershttps://www.youtube.com/watch ?v=MspVCc0_R3g&amp;t=37s #top Information to pass Name/Value Pairs Author’s Notes The next part of the URL are called query/parameters. You can use the URL to pass detailed information to the server. Sometimes this data is passed in different ways and query parameters is a common way to do this. The query starts with a question mark and you can then add a series of variables an equal sign = and then each name/value pair separated by an ampersand &amp;. In the case of our video request, we’re passing along the video ID in the v variable and and then the timecode using the t variable. Fragmentshttps://www.youtube.com/watch?v=MspVCc0_R3g&amp;t=37s #top Subordinate resource ID inside page query/parameters Author’s Notes A fragment is another way to pass information through a URL. It refers to a resource that is inside another resource. It’ used in a couple of ways on pages. You’ll often see this used inside a page to refer to another section of the same page with a specific ID. So if you go to the grid page in the Bootstrap Documentation, you’ll see the normal documentation for the grid website, but if you want to read the documentation on grid alignment, you add a # and then the name of the section of the page you want to go to. Sometimes the fragments are used more like query/parameters, it depends on how the server is set up to handle URLs."},{"title":"","date":"2018-01-12T23:00:41.566Z","updated":"2018-01-12T01:46:01.652Z","comments":true,"path":"slides/01b_hosting_on_github.html","permalink":"http://yoursite.com/fid/slides/01b_hosting_on_github.html","excerpt":"","text":"How hosting works Servers have needs Own/Rent/Services Author Notes: Although every computer on the internet can be a server, not all of them should be. A laptop would be a horrible server because any site hosted in it would go down every time you closed it. So a server needs to have: Constant power Fast connection Maintenance/updates Most companies do not own their own servers because it takes a lot of very specialized knowledge to run and maintain servers. So they either rent servers to perform a variety of web functions or simply pay for specific apps or services like email, file storage, or http hosting. Git/Github Social Coding SCM/VCS Distributed Flat file hosting Author Notes: Github is a website created to help developers use and work with others to manage code. It’s based on a techology called Git, so it provides a number of features that visualize the way that Git works and makes it easier to manage online Git is a software configuration management or SCM piece of software which means that it is designed to help you manage how your software works. There are many kinds of SCM software and Git is known as a VCS or Version Control System. One of the things that makes git unique is that it is a distributed system, which means that the code can be stored on different machines. Git allows multiple people to work on different parts or versions of the software simultaneously. So instead of an assembly line model where each person works on a car right after someone else is done, git will allow someone to paint the car, while someone else installs the engine and someone else puts in the seats. Three things that wouldn’t normally be able to be accomplished at the same time. In this way, Git is like being able to crete alternate universes, where different people can work on copies of the same code without stepping on each others’ toes. Once each person is done, they can submit their version of what they have done to a site like Github, which would manage the project. One of the features that Github provides is the ability to host simple flat-file sites to the web for free. Flat-file sites mean sites that don’t constantly need to make requests to a server for data. It’s more than what we’ll need for this class. Git/Github Language Repository Branches/Forks Commit Pull Request/Merge Issues Author Notes: In this class, we’re going to be working exclusively with Github. Git is an avanced topic outside of the scope of this class, but since Github is based on git, let’s talk about the language you use when working with Git and Github. A Repository or repo is the place where your code is hosted. It’s the grand central station for you code. Github is designed to allow multiple people to have access to the code and a central location for all of that code makes sense. A github repo has it’s own URL that has your username and the name of the repo. Github uses this URL as the basis for many features. Github allows you to create and manage branches and most of the work on repos is done in one of these. Think of each branch as an alternate universe where different people work on versions of code. Each of these branches is known as a fork; dont think of it as a kitchen fork, but more of like a fork in a tree.. So you could have one branch for people working on painting the car, while another branch for people installing the engine. Every project gets on branch which is called the master branch. It’s where the current official version of the project is. Within each of these branches we can store sub-versions of the work into something called commits. Commits are markers that define different states or our code. So, for example, if we had a branch called painting we could create a commit for when we finished painting the hood of the car. Once we finished painting the drivers side, we could have another commit called ‘driverside’, etc. Using git and github we can navigate back and forth through these commits, so that we could go back and take a look at how the care looked before it was painted and after each of the different parts of the car were painted by moving through the commits. In code this also means that we can see the difference between commmits. So you can think of commits like having access to a time machine that lets you move back and forth through the history of the project. Once someone is finishes working with a branch, it’s time to merge the project back to the master branch. We do this through a mechanism called a pull request. A pull request is a way to request that the master branch be updated with the latest version of the code that has been worked on in other branches. So it’s like you telling the boss you’ve finished with your painting and to add your painting code to the car. This step is important because it’s possible for two people to be working on the same part of the code. Think of someone installing the glass in one of the windows while someone else is painting the door. They both made changes to the door and will both need to merge their changes with the main project. Another important concept in Github is the ability for people to file issues. Issues are notes that people can write to call attention to something or to work with tasks related to organizing a project. So, if someone notices a typo on a website, you can create an issue that let’s the owner know where to fix it. Better yet, you can fork the project, fix the typo and then issue a pull request with the changes yourself. This is what makes Github really useful. Lot’s of people can work on the same project and contribute easily and effectively. Github Repos Public/private README.md file Hosting strategy Author Notes: Github offers unlimited free hosting for public projects. You can also host private projects in some of the paid plans. A lot of the web’s most important projects are hosted on Github. One of the most important files in any projects is the README.md file. This is a file with information about the project. Sort of the homepage for your project on Github. It’s written in a format called markdown. It’s a pretty simple format to learn. It’s just simple text with some minor special characters that add formatting. Github’s process for setting up hosting is called Github Pages. It will direct a special URL generated by Github or even your own URL(additional setup required) to show whatever is on your repository. You can set up your URL to point to whatever is on your master branch, a docs folder insider your master branch, a specially named gh-pages branch. The link for your project will be username.github.io by default, although it’s configurable to also be it’s own URL."},{"title":"","date":"2018-01-12T23:00:41.882Z","updated":"2018-01-12T01:46:01.653Z","comments":true,"path":"slides/02_learning_html.html","permalink":"http://yoursite.com/fid/slides/02_learning_html.html","excerpt":"","text":"What is HTML? HyperText Markup Language Hypertext Markup Author Notes: HTML stands for HyperText Markup Language and you can break that into two parts. First is HyperText and then the markup language. Let’s talk about those two things. HyperText is a document that can be linked to other related documents. Since documents are linked to each other, it creates a web of links that we know as the world wide web. Markup is special syntax for annotating a document. Think of markup as what your english teacher would do to a document when they correct it. They would ‘mark it up’ with corrections that need to be done. Semantic HTML Defines structure Never include layout HTML critical Author Notes:One of the most important jobs for HTML is to focus on the semantics of your document. Semantic means adding meaning to the content of your page. Every HTML page has three different parts to it. First, is the structure of the document, which is defined by the markup that you use to add meaning to your page. That’s what we’re talking about today. The second is the styles or CSS that can add the look and feel of the document and the last is the JavaScript that adds interactivity to your pages. It’s critical that you let each component or part handle the job it’s designed for. So it’s crucial that you NOT add anything that is not markup to HTML. Certain html markup will make certain things look at certain way, but what’s really important is that you focus on adding meaning, not looks to your document using HTML. HTML is the most critical of the three components. If you mess up the structure of the HTML, then neither the styles will work or the interactivity. Tag Structure1&lt;element [attribute[=&apos;value&apos;]...&gt;content[&lt;/element&gt;] element name 0-&infin; attributes No order in attributes Author Notes: You start HTML tags using the less than and greater than signs with an element name inside. You can use a number of elements inside the greater and less than signs. There are hundredths of elements and the best place to find them is to look online on this MDN website. Inside the first part of the element you can add none or an infinite number of attributes. These attributes will provide additional information to the browser about the tags you’re using. For example, to create an image, you use the &lt;img&gt; tag, but it doesn’t make sense to add an &lt;img&gt; tag without telling the browser the location of the image, you do that with a src attribute. Standalone vs ContainerSee the Pen zdmGxJ by Ray Villalobos (@planetoftheweb) on CodePen. Inserts vs wraps Author Notes: Standalone tags like the &lt;img&gt; tag are simply there to insert some element like an image into your page. Container tags are designed to wrap some other text or elements, so they change the meaning of what you place in there. Heading ElementsSee the Pen rzqaEv by Ray Villalobos (@planetoftheweb) on CodePen. Denote Importance Author Notes The heading elements are pretty important in HTML, they help you create headings for your document. There are six heading elements and they are containers, so they need beginning and ending versions of the tags. The number denotes importance, so a H1 is more important than an H2 and so on. You should use these to define the level of importance of the headlines in your content. Think of it like a book, the H1 would be the title and the H2 could maybe be chapter titles. Compound Tags See the Pen BdqNzQ by Ray Villalobos (@planetoftheweb) on CodePen. Lists: &lt;ol&gt;, &lt;ul&gt;, &lt;dl&gt; Author Notes Some tags like the list tags are considered compound tags because they require two sets of tags. One that defines the type of list and another that identifies the different elements within the list. In the case of lists an OL means that the order of the list items denotes some sort of order like in military ranks. An unordered list means that the list elements are in no particular order like when you make a list of groceries. Block Level ElementsSee the Pen EvdjRz by Ray Villalobos (@planetoftheweb) on CodePen. Major Sections: &lt;h1&gt;, &lt;p&gt; Author Notes: A block-level element occupies the entire space of its parent element (container), thereby creating a “block.” Are usually formatted in a new line before and after the tags by browsers Think of it as a stack of boxes or big containers. Inline ElementsSee the Pen wqYaYP by Ray Villalobos (@planetoftheweb) on CodePen. Inline Elements: &lt;a&gt;, &lt;em&gt; Author Notes:Inline elements occupy the space that are bound by the parent or container tag, they don’t break the flow of content. They are often placed inside block level elements. Structural Tags See the Pen KvGpJx by Ray Villalobos (@planetoftheweb) on CodePen. Denote function: &lt;address&gt;, &lt;header&gt;, &lt;nav&gt;&lt;section&gt;, &lt;article&gt;, &lt;aside&gt;, &lt;footer&gt; Author Notes:Structural tags add meaning to common sections of content, so for example there are tags that will help you identify the navigation, header, footer, etc. These are block level tags and they are pretty self explanatory, but their explanations can be a bit different than what you’d expect. Generic Tags See the Pen wqYqjB by Ray Villalobos (@planetoftheweb) on CodePen. &lt;div&gt; and &lt;span&gt; Author Notes: &lt;div and Span are the two generic tags. Div is the generic block level tag and span is the generic inline tag. They are super useful if you want to add meaning to a section where no tag exists. Since they are generic, they don’t affect how the page looks at all. You have to define that using CSS. Class vs IDs See the Pen dzgJbd by Ray Villalobos (@planetoftheweb) on CodePen. class vs id attributes Author Notes: Without classes and IDs, the div and span tags are pretty meaningless, since they are generic by nature and don’t change the display of the elements. You can add id and class attributes to add meaning to your generic elements OR ANY OTHER ELEMENT. Ids are unique identifiers that should happen only ONCE in your documents. Think of it as a social security or a drivers license number, everyone can only have a unique ID, so you shouldn’t have two elements with the same ID. On the other hand, you can use classes more than once in the same document. You can even use more than one class in the same element, just add a space between the class names. Classes and IDs allow you to style elements with CSS and also target them with JavaScript. Classes and ID names should start with a letter and use only lowercase characters, digits and either _ or - Basic Page 12345678910111213141516&lt;!DOCTYPE html&gt;&lt;html&gt;&lt;head&gt; &lt;meta charset=&quot;utf-8&quot;&gt; &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width&quot;&gt; &lt;title&gt;UPDATE TITLE&lt;/title&gt;&lt;/head&gt;&lt;body&gt;&lt;!-- content goes here --&gt;&lt;h1&gt;Headline&lt;/h1&gt;&lt;p&gt;Lorem ipsum dolor sit amet, consectetur adipisicing elit. Dolores vel vitae temporibus aliquid deleniti id culpa soluta natus, corrupti eaque neque et ratione. Laudantium earum assumenda beatae aspernatur id est.&lt;/p&gt;&lt;!-- content goes here --&gt;&lt;/body&gt;&lt;/html&gt; &lt;DOCTYPE&gt;, &lt;html&gt;, &lt;head&gt;, &lt;meta&gt;, &lt;title&gt;, &lt;body&gt; Author Notes:Every page needs to have a basic page structure using these elements. The DOCTYPE element defines the version of HTML that you’re using. The &lt;html&gt; element is the container for your entire document. The &lt;head&gt; element has content that you want the browser to load first and is for information that you want your browser to know about, but not necessarily be displayed to the user. The &lt;meta&gt; element is a generic tag that you can use to pass certain information about your page to your browser. in this case we’re passing along the charset, which is the types of characters used on this page. In this case it’s roman letters with accent marks, but you can use a different charset for japanese or other alphabets. The viewport meta tag tells the browser that this page has been designed with mobile devices in mind. The &lt;title&gt; element displays the title on the window menu of the current page in most browsers. It’s also important for search engines. The &lt;body&gt; element is where all of the content you want your user to be able to see goes. Whitespace, Comments, EntitySee the Pen mMzpjY by Ray Villalobos (@planetoftheweb) on CodePen. Whitespace, Comments, Entity Author Notes: Whitespace in HTML has little effect on the actual display of your content. Tabs, carriage returns and extra spaces are often converted to single spaces. Whitespace is useful to help you format the document and make it easier to read. Some editors can also use Whitespace to help you collapse related content. You can use comments anywhere in the browser, they will not show to users, but they can be useful for identifying different parts of your document. Some special characters need encoding in order to show up in the browser, these begin with an ampersand &amp; and end with a semicolon. Here’s the official list of entities. Watch out for curly quotes when pasting, curly quotes need to be encoded or converted to straight quotes. Curly quotes are often automatically set when you’re using an editor like Microsoft Word. Resources Saving: index.html Validator: Checks for errors Atom Packages: emmet, linter, atom-live-server, linter-htmlhint, html-entities, linter-csslint, emmets-snippets-compatibility Sample Resume Author Notes: When saving HTML documents you need to use the .html or .htm exension. You can save yourself and your visitors some time by using a special name for your main html document. If a document is named index.html, then the browser will assume it’s the default document for that folder.So, for example, if you’ve placed a document called resume.html in a folder called htmlresume in your projects folder…and your site is called mysite.com, then the URL to this document would be: http://mysite.com/projects/htmlresume/resume.html, however, if you name your document index.html, then you can leave the last part out. So your document would be acessible at: http://mysite.com/projects/htmlresume. It’s a bit shorter and easier to remember. The validator is a way to check that there are no errors in your document structure. ALL HTML PROJECTS UNLESS SPECIFIED MUST VALIDATE To make your life easier, you can install a few Atom packages, they are like extensions to Atom that can provide some extra features. Here’s a sample resume text so that I can practice creating the sample assignment with you in class."},{"title":"","date":"2018-01-12T23:00:42.088Z","updated":"2018-01-12T01:46:01.653Z","comments":true,"path":"slides/03_basic_css.html","permalink":"http://yoursite.com/fid/slides/03_basic_css.html","excerpt":"","text":"What is CSS? Cascading Style Sheets Layout for HTML Specificity Rules Author Notes: CSS Stands for Cascading Style sheets and that really breaks down to two things. - First we’re creating styles for the HTML document, which means that you can specify how different elements are displayed and designed. The other important part of CSS is the cascading part, which is the set of rules that determine how the styles are applied. This is known as specificity. So for example, if two rules target the same code, the latest rule would have ‘specificity’ and therefore take precendence. ExampleYou can dramatically change the look a site simply by using a different stylesheet. Take a look at the CSS Zen Garden and explore the different styles. What does it look like?See the Pen GMpdOv by Ray Villalobos (@planetoftheweb) on CodePen. Author Notes: Here’s an example with two paragraphs. Both use a strong tag, but the second one has an additional style parameter. The strong text looks bigger and red. The style attribute is one of three ways to add styles to your document. It lets you modify a style on an instance of a tag, so this change only applies to the strong tag in the second paragraph. You might be wondering why most of the text is orange, that’s because this example also has a document stylesheet. Click on the scss tab and you’ll see a couple of additional styles. This shows you that you can create a stylesheet using the style attribute in every tag, but also have styles that apply to an entire document. CSS Syntax1234selector &#123; property: value; property: value;&#125; Selectors use {} Properties/value declarations Declarations separated by ; Author Notes:Let’s take a look at the structure of an style definition. In a typical style definition, you use a selector to indicate what element you want to style, you then add as many style declarations as needed using curly braces. If you’re using the style attribute inside a tag, it’s obvious that you want to change the current tag, so you don’t need to specify a selector. To modify a style, you specify a set of properties and values. Properties are what you want to change and the values are what you want to change those to. Together, a property value pair makes something called a declaration. Multiple declarations are separated by semicolons, and you can create declarations in any order and whitespace is not really important, so use it for formatting and clarity. Using style attribute1&lt;element style=\"property: value; property: value;\"&gt; Single instance Maximum specifity Using &lt;style&gt;12345&lt;style&gt; selector &#123; property: value; &#125;&lt;/style&gt; Within html page Affects ONLY current page Should appear in &lt;head&gt; External CSS1&lt;link rel=\"stylesheet\" href=\"style.css\"&gt; Connects with outside document DO NOT use &lt;style&gt; in document Least specificity Specificity Browser/User &lt;link&gt; / &lt;style&gt; style=&quot;&quot; Inline ExerciseAdd an external style sheet to your resume Exploring Common Propertiescolor, background Color Properties color, background-color, opacity Options Values: keywords, hex, rgb(a), hsl(a) Adobe Color Color ExerciseSee the Pen GMpGba by Ray Villalobos (@planetoftheweb) on CodePen. background Exploring Common PropertiesTypography Typography font-family font-size font-style font-weight font combo Text Properties text-align text-transform line-height letter-spacing text-decoration Custom Fonts Use font-face Convert with Font Squirrel Adobe’s TypeKit Google fonts Common Font Measurements Subset of length px, rem, em Sizing with Rems Module sizing Typography ExerciseSee the Pen gGPmpw by Ray Villalobos (@planetoftheweb) on CodePen. Exploring Common PropertiesGeometry Basic Display Property Very rich property block, inline, inline-block, none inline – no width, height Advanced: flex, grid Sizing Elements padding margin border top, right, bottom, left Box ExerciseSee the Pen YrwVNY by Ray Villalobos (@planetoftheweb) on CodePen. Typical Measurements Rich measurements px, %, vh, vw min-(height/width) max-(height/width) Box Sizing FixSee the Pen WZrEyy by Ray Villalobos (@planetoftheweb) on CodePen. box sizing trick Exploring Common PropertiesSelectors CSS Selectors Type Class, ID Combinators Pseudo Class ExerciseStyle your resume"},{"title":"","date":"2018-01-12T23:00:42.239Z","updated":"2018-01-12T01:46:01.653Z","comments":true,"path":"slides/04_css_layout.html","permalink":"http://yoursite.com/fid/slides/04_css_layout.html","excerpt":"","text":"Link Pseudo-Classes :link - Unvisited links :visited – Already went here :hover – hover, watch on mobile :active - Link while being activated Try it Ordered ElementsHelp you choose elements with order in them. :first-child :last-child :nth-child :nth-of-type Try them Adding ContentAdds content before or after a certain element. :before :after glyphs Entities Try it Responsive Design Browsers have a viewport Otherwise 960px 12&lt;meta name=&apos;viewport&apos; content=&apos;width=device-width, initial-scale=1&apos;&gt; Controlling BreakpointsUse different styles for viewport sizes Use the @media selector 1234567891011body &#123; background: #839496;&#125;@media all and (max-width: 699px) and (min-width: 520px), (min-width: 1151px) &#123; body &#123; background: #DA3637; &#125;&#125; Try it Controlling Layouts Using Natural Box Layout ModelThe traditional box model doesn’t feel natural, adding margins or padding changes the width of the element. You can fix it using the code below: 123456html &#123; box-sizing: border-box;&#125;*, *:before, *:after &#123; box-sizing: inherit;&#125; Try it Stacking OrderBox ModelYou can add a background color and image to a box element, but be aware of the stacking order. (http://jsbin.com/opapos/10/embed?html,css,live)Try it] Floating Elements Force block elements side by side. When floating elements, the parent container will lose track of the height of child elements You can use a clearfix trick to fix it. 123.cf:before, .cf:after &#123; content: &quot; &quot;; display: table; &#125;.cf:after &#123; clear: both; &#125;.cf &#123; *zoom: 1; &#125; Try it PositioningThe position property lets you place elements in relation to other elements. Static: Normal positioning of objects None: Removes objects from flow and hides them from view Relative: Removes objects from normal flow and let’s you position in relation to where it would be Fixed: Removes objects from normal flow and places it relative to viewport (browser window) Absolute: Removes objects from normal flow, moves it with a parent if the parent has a position property other than static, otherwise, it’s relative to viewport (like fixed) Try it Display: Flex New Layout Model Tons of options Try it"},{"title":"","date":"2018-01-12T23:00:42.388Z","updated":"2018-01-12T01:46:01.654Z","comments":true,"path":"slides/05_bootstrap.html","permalink":"http://yoursite.com/fid/slides/05_bootstrap.html","excerpt":"","text":"What is Bootstrap? Mobile first framework Responsive design Battle tested Modern web concepts What’s a Framework? A way to organize your code If you follow a certain structure… A framework gives you many abilities. Pre-built CSS styles JavaScript functionality Installation: Basic CDNs Download and install Requires jQuery Try it The Grid Grid System 12-column grid Accessed through CSS classes Three key concepts Containers Rows Columns Bootstrap Containers Control layout Add padding Fluid vs Fixed Rows Horizontal groups of columns Place within container Should always include columns Gets rid of container padding Grid Columns 30px gutters (15px per side) col(-BP)(-COL) BP: sm &gt;576px md &gt;768px lg &gt;992px xl &gt;1200px COL: 1-12 Try it Column Metrics Extra small &lt; 576px Small ≥ 576px Medium ≥768px Large ≥992px Extra large ≥1200px Prefix .col- .col-sm- .col-md- .col-lg- .col-xl- Multiple Columns Assign multiple breakpoints Column adjusts depending on breakpoint Try it Basic Display- Mimics CSS- d(-BP)-TYPEBP: sm &gt;576pxmd &gt;768pxlg &gt;992pxxl &gt;1200pxALN:noneblockinlineinline-blockflex (options)—## Margin/PaddingPRO(SID)(-BP)-SIZ PRO: m margin p padding SID: t r b l x y BP: sm &gt;576px md &gt;768px lg &gt;992px xl &gt;1200px SIZ: 0 1 2 3 4 5 auto—## Basic Flex Container- d(-BP)(-inline)-flexBP: sm &gt;576pxmd &gt;768pxlg &gt;992pxxl &gt;1200px- Try it—# Navbars—## Navbar Classes navbar navbar-expand(-BP) BP: sm &gt;576px md &gt;768px lg &gt;992px xl &gt;1200px navbar-nav Navbar Colorsbg-COLOR for backgrounds primary secondary success danger warning info light dark white navbar-light navbar-dark navbar-nav Options nav-item &amp; nav-link active &amp; disabled Try it Custom Color- Carousels Basic Carousel carousel data-ride=&quot;carousel&quot; carousel-inner carousel-item Speaker Notes: The main container to use is of course carousel If you want the carousel to automatically animate when the page loads, use data-ride=”carousel”, there are a lot of other options you can activate using data attributes or javascript…more of that in a sec. carousel-inner is the main container for the images carousel-item is a wrapper for each image. Options one element active Crop and size photos Speaker Notes: At least one of the carousel image containers should have a class of active. Also, bootstrap is not going to perform any sizing on your images, so make sure you crop and resize your images. You may also need to size your images using css. Captions carousel-caption 1234&lt;div class=&quot;carousel-caption d-none d-md-block&quot;&gt; &lt;h3&gt;...&lt;/h3&gt; &lt;p&gt;...&lt;/p&gt;&lt;/div&gt; Speaker Notes: There is a special class for captions called carousel-caption. Navigation data-target carousel-control-prev carousel-control-prev-icon carousel-control-next carousel-control-next-icon Speaker Notes: You can add previous and next icons on the images using classes. Indicators carousel-indicators data-target data-slide-to Speaker Notes: You can also add indicators. They look very different from the old indicators, but are just easy to set up. Data Attributes interval : 5000 pause : hover | null ride : false wrap : true Try it Try it"},{"title":"","date":"2018-01-12T23:00:42.537Z","updated":"2018-01-12T01:46:01.654Z","comments":true,"path":"slides/05_graphics.html","permalink":"http://yoursite.com/fid/slides/05_graphics.html","excerpt":"","text":"Bitmaps AKA Raster Graphics Grid of pixels 3 dimensions: width, height, depth Bitmap Depth Depth = how many colors More colors = richer depth Bigger depth = bigger size Great for Photographs Vectors Resolution independent Mathematical formulas Converted to Bitmaps Web Formats GIF JPG PNG SVG GIF Oldest format Up to 256 colors 1-bit transparency Supports animation JPEG 256 colors (8-bits) per channel Perfect for photos Highly compressed PNG Best quality (64-bits) per channel Best Transparency Not Lossy Not as small as JPEG Better at simple graphics SVG Great new format Vector Format Animation CSS Styling Reducing Image Size Cameras take HUGE pictures Crop or resize Reduce pixel density Reducing Size PNG - small colors QTY JPG for photos Resize/crop Thumbnails Compression ExerciseUse Photoshop to re-compress your sample images. Create Thumbnails of images at least 300px x 200px"},{"title":"","date":"2018-01-12T23:00:42.703Z","updated":"2018-01-12T01:46:01.654Z","comments":true,"path":"slides/06_javascript.html","permalink":"http://yoursite.com/fid/slides/06_javascript.html","excerpt":"","text":"What is JavaScript? Responsible for Interaction Scripting Language Runs on client What is it good for? DOM Management Event Handling AJAX Communication How do you use it? Inline, &lt;script&gt;, &lt;script src=&quot;&quot;&gt; Inline w/event attributes Inefficient practice Try itSee the Pen EwLxKz by Ray Villalobos (@planetoftheweb) on CodePen. Using the &lt;script&gt; tag Better than inline, but maintainable Code executes when script read Try ItSee the Pen aLGbZe by Ray Villalobos (@planetoftheweb) on CodePen. As an external document Using &lt;script src=&quot;&quot;&gt;&lt;/script&gt; &lt;script&gt; position important JavaScript Variables Losely typed Basic types 123var myName = &apos;Ray&apos;;var myNumber = 3;var myBoolean = true; JavaScript Lists 0 Indexed 12345var myList = [&apos;Ray&apos;, &apos;Fred&apos;, &apos;Bonnie&apos;];var otherList = [&apos;Ray&apos;, 3, false];myList[1]; //Fred;otherList[0]; //Ray; Try itSee the Pen dVeyLW by Ray Villalobos (@planetoftheweb) on CodePen. JavaScript Objects Complex data type Holds any var type 1234567891011var info = &#123; &quot;full_name&quot; : &quot;Ray Villalobos&quot;, &quot;title&quot; : &quot;Staff Author&quot;, &quot;links&quot; : &#123; &quot;blog&quot; : &quot;http://iviewsource.com&quot;, &quot;facebook&quot; : &quot;http://facebook.com/iviewsource&quot;, &quot;youtube&quot; : &quot;http://www.youtube.com/planetoftheweb&quot;, &quot;podcast&quot; : &quot;http://feeds.feedburner.com/authoredcontent&quot;, &quot;twitter&quot; : &quot;http://twitter.com/planetoftheweb&quot; &#125;&#125;; Try itSee the Pen rGvaxx by Ray Villalobos (@planetoftheweb) on CodePen. Document Object Model (DOM) Page structure Add, delete &amp; modify querySelector() querySelectorAll() Try itSee the Pen dVePvJ by Ray Villalobos (@planetoftheweb) on CodePen. Events Things that happen Clicks, mouseOvers, etc. Try ItSee the Pen rGvaZy by Ray Villalobos (@planetoftheweb) on CodePen. Conditional Statements True or False Execute when conditions met Try itSee the Pen WZJbYb by Ray Villalobos (@planetoftheweb) on CodePen. Loops Repeat execution 1234for (var index = 0; index &lt; array.length; index++) &#123; var element = array[index]; &#125; Try itSee the Pen LzmEMm by Ray Villalobos (@planetoftheweb) on CodePen. Functions Like a macro Can have parameters Try itSee the Pen MEGYdJ by Ray Villalobos (@planetoftheweb) on CodePen.—## jQuery- JS Library- Fixes incompatibilities- Uses the $ variable—## Try itSee the Pen pWVJgR by Ray Villalobos (@planetoftheweb) on CodePen."},{"title":"","date":"2018-01-12T23:00:42.862Z","updated":"2018-01-12T01:46:01.655Z","comments":true,"path":"slides/07_forms.html","permalink":"http://yoursite.com/fid/slides/07_forms.html","excerpt":"","text":".formsamples label { font-size: .6em !important; line-height: .8em !important; } .formsamples input { padding: 10px !important; font-size: .8em !important; } .formsamples textarea { padding: 10px !important; font-size: .8em !important; } .formsamples select { padding: 10px !important; font-size: .8em !important; } .formsamples input[type=checkbox], .formsamples input[type=radio] { width: 20px !important; height: 20px !important; } .formsamples button, .formsamples input[type=reset] { padding: 10px !important; } Working with Forms by Ray Villalobos Use arrow keys to advance or esc Understanding Forms Client &amp; application communication Respond to user input Bridge between users and data How forms work Fill out form &amp; Submit Data sent to a processor Processor performs an action The browser receives a response Processing Forms The &lt;form&gt; tag &lt;form action=”process.php” method=”post” enctype=”” &gt; &lt;label&gt;Name: &lt;input name=&quot;fullname&quot;&gt;&lt;/label&gt; &lt;input type=&quot;submit&quot; &gt;&lt;/form&gt; Action - Where to send the data to Method - How to send the data Enctype - How to encode the data Try it Add a second last name field to this form. The get method &lt;form method=&quot;get&quot; action=&quot;processform.php&quot; &lt;label&gt;Name: &lt;input name=&quot;fullname&quot;&gt;&lt;/label&gt; &lt;label&gt;Title: &lt;input name=&quot;title&quot;&gt;&lt;/label&gt; &lt;input type=&quot;submit&quot; &gt;&lt;/form&gt; get - Sends data through a URL processform.php?fullname=Ray+Villalobos&amp;title=Staff+Author Name/Value pairs encoded into URLs The post method &lt;form method=&quot;post&quot; action=&quot;processform.php&quot;&gt; &lt;label&gt;Name: &lt;input name=&quot;fullname&quot;&gt;&lt;/label&gt; &lt;label&gt;Title: &lt;input name=&quot;title&quot;&gt;&lt;/label&gt; &lt;input type=&quot;submit&quot; &gt;&lt;/form&gt; post - Sends data in the background Used for longer forms More secure The label tag &lt;form method=&quot;post&quot; action=&quot;processform.php&quot;&gt; &lt;label&gt;Name: &lt;input name=&quot;fullname&quot;&gt;&lt;/label&gt;&lt;br&gt; &lt;label for=&quot;title&quot; &gt;Title:&lt;/label&gt; &lt;input id=&quot;title&quot; name=&quot;title&quot;&gt;&lt;br&gt; &lt;input type=&quot;submit&quot; &gt;&lt;/form&gt; Ties label to the input field Assumed if it wraps the input Use FOR on label, ID on input Try it Add another field with an extra label. Types of fields Many different types Text: checkbox radio Textarea: OptionItem 1Item 2Item 3Item 4 Click me The input field Text: &lt;input name=”firstName” &gt; Assumed to be a text field Tons of attributes Many other types: button, checkbox, color, date , datetime , datetime-local , email , file, hidden, image, month , number , password, radio, range , reset, search, submit, tel, text, time , url, week Try it Try other input types &amp; attributes Password/File Password: &lt;input type=&quot;password&quot; &gt; Files: &lt;input type=&quot;file&quot; &gt; Checkbox/Radio Checkbox: this and/or that &lt;input type=&quot;checkbox&quot; &gt; Checkbox: this and/or that &lt;input type=&quot;checkbox&quot; checked &gt; Radio: this but not that &lt;input type=&quot;radio&quot; &gt; hidden input fields Hidden: &lt;input type=&quot;hidden&quot; name=&quot;hiddenfield&quot; value=&quot;secretvalue&quot; &gt; buttons &lt;input type=&quot;submit&quot; &gt; &lt;input type=&quot;submit&quot; value=&quot;click me&quot; &gt; &lt;input type=&quot;reset&quot; &gt; click me &lt;button&gt;click me&lt;/button&gt; image buttons &lt;input type=&quot;image&quot; src=&quot;images/headlights.jpg&quot;alt=&quot;order headlights&quot; &gt; TextArea Textarea: &lt;textarea name=&quot;longertext&quot;&gt;&lt;/textarea&gt; &lt;textarea name=&quot;longertext&quot;&gt;Some Text&lt;/textarea&gt; Select/Option &lt;select name=”myoptions”&gt; &lt;option &gt;Choose…&lt;/option&gt; &lt;option value=”a” &gt;Label 1&lt;/option&gt; &lt;option value=”b” &gt;Label 2&lt;/option&gt; &lt;option value=”c” &gt;Label 3&lt;/option&gt; &lt;option value=”d” &gt;Label 4&lt;/option&gt;&lt;/select&gt; Select: Choose… Item 1 Item 2 Item 3 Item 4 selected attribute Using Form Fields Select/Option Multiple &lt;select multiple name=”myoptions”&gt;&lt;option value=”a” &gt;Label 1&lt;/option&gt;&lt;option value=”b” &gt;Label 2&lt;/option&gt;&lt;option value=”c” &gt;Label 3&lt;/option&gt;&lt;option value=”d” &gt;Label 4&lt;/option&gt;&lt;/select&gt; Multiple: Item 1Item 2Item 3Item 4 Using Form Fields HTML5 Date: &lt;input type=&quot;date&quot; &gt; Color: &lt;input type=&quot;color&quot; &gt; Range: &lt;input type=&quot;range&quot; &gt; Using Form Fields HTML5 autocomplete placeholder required pattern, Sample patterns Try it Try some Bootstrap Forms Automatic Styles Use columns for layouts Special classes for checkbox and radio Use &lt;div class=&quot;form-group&quot;&gt;&lt;/div&gt; to create a group Try it Horizontal Form"},{"title":"","date":"2018-01-12T23:00:43.020Z","updated":"2018-01-12T01:46:01.655Z","comments":true,"path":"slides/08_tables.html","permalink":"http://yoursite.com/fid/slides/08_tables.html","excerpt":"","text":"Using Tables by Ray Villalobos Use arrow keys to advance or esc What are they for? Tabular data Not for layout Basic Tables Compound tag &lt;table&gt; tag holds others &lt;tr&gt; table rows &lt;th&gt; header cell Try it Add another table row The colspan &amp; rowspan attribute Lets you make a cell span more than one td Like merge cells in Excel Total number of cells must still be the same Colspan horizontal, rowspan vertical Try it Experiment using the colspan attribute The &lt;caption&gt; tag Optional tag, describes the table Must go immediately after the &lt;table&gt; tag Only one caption per table Try it Modify the caption The &lt;thead&gt; tag Lets you group header content Use with &lt;tbody&gt; and &lt;tfoot&gt; Inside the &lt;table&gt;, after the &lt;caption&gt; and before &lt;tbody&gt; or &lt;tr&gt; Try it Use CSS to change the background color of thead The &lt;tbody&gt; tag Lets you group body content Use with &lt;thead&gt; and &lt;tfoot&gt; Inside the &lt;table&gt;, after the &lt;caption&gt; and &lt;thead&gt; elements Try it Use CSS to change the style of tbody The &lt;tfoot&gt; tag Lets you group body content Use with &lt;thead&gt; and &lt;tbody&gt; Inside the &lt;table&gt;, after the &lt;caption&gt;, &lt;thead&gt; and before &lt;tbody&gt; or &lt;tr&gt; Try it Experiment using the colspan attribute The &lt;th&gt; tag Identifies cells as header cells Need the scope attribute as col or row Display as bold and centered Try it Experiment using the colspan attribute Bootstrap Classes Bootstrap adds a bunch of classes table, table-striped, table-bordered, table-hover, table-condensed Additional Contextual classes: active, success, info, warning, danger Try it Experiment with Bootstrap table classes Bootstrap Responsive Wrap &lt;div class=&quot;table-responsive&quot;&gt;&lt;/div&gt; Table scrolls horizontally on small devices Don’t forget the viewport tag. Try it Resize window to make it reponsive"},{"title":"","date":"2018-01-12T23:00:43.335Z","updated":"2018-01-12T01:46:01.656Z","comments":true,"path":"slides/10_seo.html","permalink":"http://yoursite.com/fid/slides/10_seo.html","excerpt":"","text":"What does it mean? Better exposure in Search Results Improving your authority on a topic What does Google want? Find relevant results Rank results based on authority Sell ads What people want Information Socialize Purchasing Kill some time How people search Keyword phrases not words Video or Photo Look at the title, description and URL Decide based on intent What they get Blended results: Local, Maps, etc. Organic–naturally showing up in results Paid–What you do outside your page Authority determination How many sites link to your site Content related to keyword phrase How current your content is What is your inventory on this topic Keyword Research Keyword Research Focus on Phrases Volume, Relevance and Competition Google Keyword Tool Part of AdWords Shows how people are searching Free Keyword Research Google Insights for search History Geography Related keywords Planning Content Post unique and fresh content regularly Optimize your titles and content Use keyword phrase driven text Use social networks Off Page Quality inbound links Do not be part of a lot of links Links from higher PageRank sites are better Organic links in body text are better Vary your inbound link destinations URLs Most important Domain name is more critical than page titles Have keywords in the URL Make them easy to read: not ?id=456 Page Titles Very important Unique, descriptive and keyword driven Use the description meta tag Heading Tags Pretend writing an outline Use headings sparingly Add keywords to your heading naturally Promoting Site Blog and tweet often Use URLs on print, QR codes Use Google places"},{"title":"","date":"2018-01-12T23:00:43.483Z","updated":"2018-01-12T01:46:01.656Z","comments":true,"path":"slides/11_analytics.html","permalink":"http://yoursite.com/fid/slides/11_analytics.html","excerpt":"","text":"What are Analytics? How Traffic works on your site Effectiveness of your efforts Determine value of the visitors Interactions with your content Identify performance issues What Analytics will not do Diagnose issues Fix problems for you How Analytics work Create accounts for sites Insert a JS file on your pages Keeps track of user navigation Stores it as data Creates reports GA Tiers GA Standard (&lt;200k visits) Large Site (24 hours or more) Small Site (3-4 hours or more) GA Premium (&gt;200k visits) Large Site (&lt;4 hours - minutes) Small Site (Usually minutes) Basic Metrics Sessions Users PageViews Pages/Sessions Avg Duration Bounce Rate % New Sesssions Data Over Time Default last 30 days Data can be adjusted by date View my Hourly, Day, Week, Month Multiple Date Ranges Demo"},{"title":"","date":"2018-01-12T23:00:43.632Z","updated":"2018-01-12T01:46:01.657Z","comments":true,"path":"slides/12_advertising.html","permalink":"http://yoursite.com/fid/slides/12_advertising.html","excerpt":"","text":"History Online Advertising started out as display advertising Ads sold based on impressions CPM - Cost per thousand How many times the ad is shown The rise of Google Google pioneered two approaches Contextual Advertising Ads sold based on it’s surroundings CPC - Cost Per Click model You pay only for ads people click on Ad Networks Bidding for Keyword phrases Advertisers pay based on Model (CPC, CPM, CPA) Network takes a cut Networks pay less than a direct sale Publishers earn revenue for content Izea Important Analytics Pageviews CTR CPC (Cost per click) Behavioral Targeting Ads based on a person’s interests Requires large amount of data Facebook Leverages Social Graph Perfect for Social Networks Privacy Issues Why companies give away free stuff Sample Models Google - Facebook - Ads 80% of revenue Twitter - Ads 90% of revenue LinkedIn - (Talent 52%, Marketing 23%, Subs 20%) Lynda.com (Memberships $25/month) Other Models Email Marketing (Higher CTR) Deal Offers (CPA) Podcast Marketing Sponsorships-Other Models"},{"title":"","date":"2018-01-12T23:00:43.789Z","updated":"2018-01-12T01:46:01.657Z","comments":true,"path":"slides/13_business.html","permalink":"http://yoursite.com/fid/slides/13_business.html","excerpt":"","text":"Professional Background DTP Assistant/Trainer at Computer Reseller Graphic Designer at Different Print Shops Senior Interactive Designer at Tribune Interactive Director of Multimedia at Entravision Staff Author, Lynda.com/LinkedIn How I got my start How I found computers - Indiana Jones &amp; Curiosity Becoming a geek - Solving Problems Failing at Basketball - Focus Found my calling helping others Leveraging Opportunities Networking turns to a job Training leads to a book deal Becoming an Adjunct Flipping classroom into LDC LDC into speaking at Conferences Getting Demoted/Promoted Promotion is not Pride No one else is responsible Opportunities will come to you Doubling my Salary by being nice Making Money At Conferences Getting Published Be authoritative Find a unique angle Stalking Contacts/LinkedIn/Twitter Find them at Conferences Offer to review books Don’t be afraid to Seek/Ask Freelancing Friends/family Translates to paid gigs Establish a minimum price e.g. My minimum price for a 5 page website is $500, does that sound like something within your range?” How do I determine my rate? Depends on experience Changes as you get busier/better Tangible $30-100/hr, $100/page, $50 photo How do I determine my rate? Take into account all costs Figure out your expenses What makes you happy(http://thenextweb.com/lifehacks/2011/06/22/freelance-at-a-glance-infographic/) How do I get clients? Referrals Social Media: Website, Beehance, Dribble, github, LinkedIn Network Build a blog and post regularly Attend events How do I get clients? Retweet people you appreciate Write thank you notes Send someone a thank you basket Give a referral fee Freelancing Growth opportunities Web Programming Mobile Apps Graphic &amp; Web Design Online Marketing Content Writing Freelancing How do I get clients? Getting a job Getting a job from job sites is rare People want to hire people they like Be nice to people The hiring process Human Resources Interview Offer Negotiating Be ready Opportunity knocks all the time Study, build your portfolio, write Take responsibility if it’s a heck yeah! Learning = Earning The 15% solution Creating a proposal Work Summary Confidentiality Recommendation (Site Map) Rates (Page/Hourly/Mainenance) Deposit (50%) Creating a proposal Billing Due dates Copyrights Termination Setting up a business Start out as freelancer File a fictitious Name Registration Apply for a business license Open up a bank account Get business cards Business resources Mint.com Google Docs PayPal Freshbooks"},{"title":"Reveal.js","date":"2018-01-12T23:00:43.944Z","updated":"2018-01-12T01:46:01.657Z","comments":true,"path":"slides/demo.html","permalink":"http://yoursite.com/fid/slides/demo.html","excerpt":"","text":"Installing Grab/Fork from repo docs folder has presentation slides/demo.md subfolder has main markdown 100% Markdown Rayveal assumes you want to use markdown to create slides. The index.html file points to a markdown file in slides/demo.md. It does whatever reveal.js can can. You can add invisible notes for yourself using two &gt; &gt; after a carriage return (see markdown file) Author Notes: Author notes are similar to markdown blockquotes, but you use double greater than signs. They won’t appear on your slides, so I personally use them as reading notes, but Reveal.js has a presentation mode that allows you to see them in your slides. Persistent NavigationNotice: the persistent navigation bar at the bottom is on every page. It will disappear after 5 seconds. You can also toggle it by hitting the ctrl-t key. To modify, look for the following code (delete it if you don’t need it) 1234567&lt;footer class=&quot;footer&quot;&gt; &lt;div class=&quot;persistent&quot;&gt; &lt;strong&gt;Slides:&lt;/strong&gt; &lt;a href=&quot;http://bit.ly/thenext50&quot;&gt;bit.ly/thenext50&lt;/a&gt; &amp;bull; &lt;strong&gt;Contact:&lt;/strong&gt; &lt;a href=&quot;https://www.linkedin.com/in/planetoftheweb&quot;&gt;LinkedIn&lt;/a&gt; | &lt;a href=&quot;https://www.linkedin.com/learning/instructors/ray-villalobos&quot;&gt;courses&lt;/a&gt; | &lt;a href=&quot;http://twitter.com/planetoftheweb&quot;&gt;@planetoftheweb&lt;/a&gt; | &lt;a href=&quot;http://github.com/planetoftheweb&quot;&gt;github&lt;/a&gt; &lt;/div&gt; &lt;div class=&quot;smaller&quot;&gt;Use arrows to navigate, esc for overview&lt;/div&gt;&lt;/footer&gt; Author Notes: Author notes are similar to markdown blockquotes, but you use double greater than signs. They won’t appear on your slides, so I personally use them as reading notes, but Reveal.js has a presentation mode that allows you to see them in your slides. Multiple slidesYou can use multiple markdown files within the same slide, just add a different slide in the slides folder and link to it. (see markdown file for how it works)Sidebar MenuPress the ctrl-m key to show sidebar menu. You can use it to jump to different slides. There is also an index.txt file in the slides menu, where you can add other slides you want to feature in your menu. Standalone FolderPresentations live in a docs folder within the main project, simply upload the docs folder to a server and change the name if you want. It’s self contained. It’s also easy to add as documentation using Github Pages. Fragments Are on by default You can write HTML lists if you don’t want them Code options Bootstrap-like colors for code primary success info warning danger tooltipsfor overlay explanations on rollover Has Icon Template with an icon Preloading font-awesome by Dave Gandy &lt;!– .slide: data-state=”hasicon” –&gt; Background Video &lt;!– .slide: data-state=”textonvideo” data-background-video=”http://planetoftheweb.com/i/video.mp4“ –&gt; Note: You also have the option of creating video as a background using regular reveal.js tags. Background with an imageAnd some text, small shadow… &lt;!– .slide: data-state=”textonimage” data-background-image=”http://planetoftheweb.com/i/photo.jpg“ –&gt; Here’s some code123456789var electron = require('electron');var BrowserWindow = electron.BrowserWindow;var app = electron.app;app.on('ready', function() &#123; var appWindow; appWindow = new BrowserWindow(); appWindow.loadURL('http://raybo.org');&#125;); Syntax highlighted, editable by default Embedded CodeHere’s a sample of an embeded CodePen. Use an iframe. See the Pen Bootstrap 4 by Ray Villalobos (@planetoftheweb) on CodePen. TablesHere’s what a table looks like. Use the tables generator to help you write the markdown. Extra small &lt; 768px Small ≥ 768px Medium ≥992px Large ≥1200px Container Auto 750px 970px 1170px Size .col-xs- .col-sm- .col-md- .col-lg- Column width Auto ~62px ~81px ~97px Circles one two three four five just list items &lt;!– .slide: data-state=”circles” –&gt;"},{"title":"slides","date":"2018-01-10T20:34:20.000Z","updated":"2018-01-12T01:46:01.657Z","comments":true,"path":"slides/index.html","permalink":"http://yoursite.com/fid/slides/index.html","excerpt":"","text":""},{"title":"Course Syllabus","date":"2018-01-06T19:34:20.000Z","updated":"2018-01-09T14:07:28.078Z","comments":true,"path":"syllabus/index.html","permalink":"http://yoursite.com/fid/syllabus/index.html","excerpt":"","text":"The purpose of Fundamentals of Interactive Design is to give the students an overview of working with core Web Technologies and learning to build a web presence. Specifically, you’ll learn the basics of HTML, CSS and we’ll use the Bootstrap framework to build a series of smaller and large projects. Materials needed A Github Account (free) A lynda.com account: Available for free Seminole Library Osceola Library Orange Library Volusia Library Veterans (LinkedIn program) Here’s a video on How to use Lynda.com An HTML text editor: Visual Studio Code or Atom Here’s a video on Visual Studio Code Here’s a video on Atom Note: There is no book required for this class. Class Structure I’ll start each class reviewing the week’s previous assignments. This is an important way for me to give you feedback on the work you’re doing for the class and it’s part of working in the field. Please don’t take it personally, critiques can be difficult to hear, but I have your best interests in mind. I expect you to be here during this time and listen to what I tell you. I also expect you to fix issues I mention during the critiques. After critiques, I’ll give the class a lecture and may give you a link to an online slide presentation. The presentation may have some short exercises for you to finish during class. After the lecture, we’ll have some lab time for this course. I expect you to use this time to work through the exercises. Do NOT work on other class coursework during my class. If you don’t have any questions or are caught up on your assignments you are welcome to leave the class quietly. Assignment SubmissionsAssignments in this class are designed to help you work towards your projects. A big part of your grade will depend on you being able to keep up with the assignments. Assignments are due on the time and date mentioned in Canvas. If you fail to turn assignments in when they’re due, you’ll receive a 0 for the assignment. I will grade assignments roughly the week after they’re due. Use that time to correct errors or issues I’ve mentioned during the critiques for a better grade. Make sure you read the instructions and ruberic for the assignments. I will award different points as detailed in the ruberic section of the assignments. Github RepoIn addition to Canvas, there is a github repository for this course, where you can ask questions and find slides and other documentation for the course. You’ll be creating your own repository for the course in order to do the assignments, so make sure you get started by getting a github account. Asking questionsIf you have questions, you can easily ask them usingGithub Issues. Please make sure you follow the guidelines for issue submissions. It’s not realistic for me to be answering questions about the assignments hours before the assignment is due, so make sure you get started early, so you can give me enough time to answer and for you to react to those answers. I expect you to ask me questions no later than a day before the assignment is due. Personal Assistance in LabsI am an adjunct, which means that I have no office hours or an office at the college. I can answer questions through github issues and will be happy to do so or help you during class. If you need additional assistance, there are a number of labs available throughout the campus. Make sure youcheck the schedules for when the labs are available. Learn more Github for Web Designers Learn Git and Github Git Essential Training"}],"posts":[{"title":"Create a Valid HTML Page","slug":"valid-html","date":"2018-01-16T05:00:00.000Z","updated":"2018-01-09T22:54:12.495Z","comments":true,"path":"assignments/valid-html/","link":"","permalink":"http://yoursite.com/fid/assignments/valid-html/","excerpt":"Create a single page document for your website with basic information for your portfolio.","text":"Create a single page document for your website with basic information for your portfolio. Watch these The importance of HTML Basic HTML Syntax Exploring an HTML document structure Formatting content with HTML The Value of Structure Creating links Inserting images Unordered lists Turning in your project On your desktop, create a folder called projects Inside that folder, create a subfolder called validhtml Inside that folder, create a file called index.html Use this basic html template to get your page started Inside the body section of the document write some text with a basic portfolio Upload the folder to your github repo (drag and drop it onto your repository) Use the w3c validator and make sure your the URL to your project validates Sections for resumeA short paragraph with a welcome message plus 4-6 sentences that include a short bio about yourself (see the example bio on my LinkedIn Learning page. SkillsAn unordered list of your skills. These would be something other than software skills. In LinkedIn, they appear in the Featured Skills and endorsements. For example the top skills on my LinkedIn profile are listed as: User Interface Design, User Experience, Web Development, CSS, JavaScript, etc. Please list at least ten skills…think of the skills you’ll be learning in this or other classes this semester. Software/HardwareThis is a list of the software and hardware you’re comfortable with. Don’t use specific version of software. If possible, try to make it specific to your career. If you’re going into graphic design, then perhaps Photoshop and InDesign might be something you’d list, for 3-D animation, perhaps Maya and for video, After Effects. At least five. Social Media/WebA list of links to your public social media profiles or other websites where people can find you; things like LinkedIn, Twitter, Youtube, etc. At the very least, you should link to your website address, and your github repo. If you’re a graphic designer, perhaps a link to Beehance. Work SamplesThese will be images to samples of previous work. If you’ve done some work for other classes, these will be a great place for them. If you don’t already have them online, upload them to your server like you did the photos and create links for them. At least 5 images. Expectations Use headlines (H1-H6) for headings Use paragraph tags for paragraphs Use br tags, but ONLY for breaking up single lines of text. DO NOT use this for formatting your document or adding extra vertical spacing. Convert text links to URLs using the anchor tag Convert links to work samples to images using the img tag. Use ordered and unordered lists where necessary. Use the strong tag to give strong importance to text. DO NOT use any tags not mentioned in this list. DO NOT use anything that will format or style the document in any way.","categories":[{"name":"assignments","slug":"assignments","permalink":"http://yoursite.com/fid/categories/assignments/"}],"tags":[{"name":"html","slug":"html","permalink":"http://yoursite.com/fid/tags/html/"},{"name":"week 02","slug":"week-02","permalink":"http://yoursite.com/fid/tags/week-02/"}]},{"title":"Create a Github Repository and Site","slug":"github-site","date":"2018-01-09T05:00:00.000Z","updated":"2018-01-09T22:54:12.494Z","comments":true,"path":"assignments/github-site/","link":"","permalink":"http://yoursite.com/fid/assignments/github-site/","excerpt":"For this assignment, you’ll simply create a Github Account and create your first Github issue in the class repo","text":"For this assignment, you’ll simply create a Github Account and create your first Github issue in the class repo Class Resources Slides Notes Online Resources Creating a new Repository Creating an Issue in Github Configuring Github Pages markdown syntax Information for Github IssueIn the issue you will include the following: A link to your public class Github Repository A link to your Github Pages site. A one or two sentence answer to each of the following questions (pretend you’re interviewing for a job in my company) What experience do you have building websites? What software experience do you currently have? What are some of your strongest soft skills (read this)? Where do you see yourself working after you complete your studies? Submitting the IssueCreate a README.md file on your site (help with markdown syntax). You’re welcome to use the same info in the issues or keep it simpler. Remember that Github as well as this class repo is a public website, so the issues will be public. You don’t have to put your name on these. You will submit a link to your Github Issue in canvas to complete this assignment.","categories":[{"name":"assignments","slug":"assignments","permalink":"http://yoursite.com/fid/categories/assignments/"}],"tags":[{"name":"github","slug":"github","permalink":"http://yoursite.com/fid/tags/github/"},{"name":"week 01","slug":"week-01","permalink":"http://yoursite.com/fid/tags/week-01/"}]},{"title":"Create a Lynda.com Account","slug":"lynda-com","date":"2018-01-09T05:00:00.000Z","updated":"2018-01-09T22:54:12.495Z","comments":true,"path":"assignments/lynda-com/","link":"","permalink":"http://yoursite.com/fid/assignments/lynda-com/","excerpt":"For this assignment you will create an account for lynda.com. It’s not a free account, but you can find it at some public libraries for free. Go to your public library and ask for a special code to receive a lynda.com account. They will give you further instructions to set this up.","text":"For this assignment you will create an account for lynda.com. It’s not a free account, but you can find it at some public libraries for free. Go to your public library and ask for a special code to receive a lynda.com account. They will give you further instructions to set this up. Seminole Library Osceola Library Orange Library Volusia Library Veterans How to use Lynda.com To submit this assignment, send me a screenshot of the lynda.com website once you’ve created and set up your lynda.com account. I should be able to see your name or account on the upper right hand site of the screenshot. Videos Taking a Screenshot on a PC Taking a Screenshot on a Mac","categories":[{"name":"assignments","slug":"assignments","permalink":"http://yoursite.com/fid/categories/assignments/"}],"tags":[{"name":"week 01","slug":"week-01","permalink":"http://yoursite.com/fid/tags/week-01/"},{"name":"lynda","slug":"lynda","permalink":"http://yoursite.com/fid/tags/lynda/"}]}]}