{"meta":{"title":null,"subtitle":null,"description":"This is a website for my class Fundamentals of Interactive Design at Seminole State College.","author":"Ray Villalobos","url":"http://yoursite.com/fid"},"pages":[{"title":"Course Syllabus","date":"2018-01-06T19:34:20.000Z","updated":"2018-01-09T14:07:28.078Z","comments":true,"path":"syllabus/index.html","permalink":"http://yoursite.com/fid/syllabus/index.html","excerpt":"","text":"The purpose of Fundamentals of Interactive Design is to give the students an overview of working with core Web Technologies and learning to build a web presence. Specifically, you’ll learn the basics of HTML, CSS and we’ll use the Bootstrap framework to build a series of smaller and large projects. Materials needed A Github Account (free) A lynda.com account: Available for free Seminole Library Osceola Library Orange Library Volusia Library Veterans (LinkedIn program) Here’s a video on How to use Lynda.com An HTML text editor: Visual Studio Code or Atom Here’s a video on Visual Studio Code Here’s a video on Atom Note: There is no book required for this class. Class Structure I’ll start each class reviewing the week’s previous assignments. This is an important way for me to give you feedback on the work you’re doing for the class and it’s part of working in the field. Please don’t take it personally, critiques can be difficult to hear, but I have your best interests in mind. I expect you to be here during this time and listen to what I tell you. I also expect you to fix issues I mention during the critiques. After critiques, I’ll give the class a lecture and may give you a link to an online slide presentation. The presentation may have some short exercises for you to finish during class. After the lecture, we’ll have some lab time for this course. I expect you to use this time to work through the exercises. Do NOT work on other class coursework during my class. If you don’t have any questions or are caught up on your assignments you are welcome to leave the class quietly. Assignment SubmissionsAssignments in this class are designed to help you work towards your projects. A big part of your grade will depend on you being able to keep up with the assignments. Assignments are due on the time and date mentioned in Canvas. If you fail to turn assignments in when they’re due, you’ll receive a 0 for the assignment. I will grade assignments roughly the week after they’re due. Use that time to correct errors or issues I’ve mentioned during the critiques for a better grade. Make sure you read the instructions and ruberic for the assignments. I will award different points as detailed in the ruberic section of the assignments. Github RepoIn addition to Canvas, there is a github repository for this course, where you can ask questions and find slides and other documentation for the course. You’ll be creating your own repository for the course in order to do the assignments, so make sure you get started by getting a github account. Asking questionsIf you have questions, you can easily ask them usingGithub Issues. Please make sure you follow the guidelines for issue submissions. It’s not realistic for me to be answering questions about the assignments hours before the assignment is due, so make sure you get started early, so you can give me enough time to answer and for you to react to those answers. I expect you to ask me questions no later than a day before the assignment is due. Personal Assistance in LabsI am an adjunct, which means that I have no office hours or an office at the college. I can answer questions through github issues and will be happy to do so or help you during class. If you need additional assistance, there are a number of labs available throughout the campus. Make sure youcheck the schedules for when the labs are available. Learn more Github for Web Designers Learn Git and Github Git Essential Training"}],"posts":[{"title":"Create a Valid HTML Page","slug":"valid-html","date":"2018-01-16T05:00:00.000Z","updated":"2018-01-09T22:54:12.495Z","comments":true,"path":"assignments/valid-html/","link":"","permalink":"http://yoursite.com/fid/assignments/valid-html/","excerpt":"Create a single page document for your website with basic information for your portfolio.","text":"Create a single page document for your website with basic information for your portfolio. Watch these The importance of HTML Basic HTML Syntax Exploring an HTML document structure Formatting content with HTML The Value of Structure Creating links Inserting images Unordered lists Turning in your project On your desktop, create a folder called projects Inside that folder, create a subfolder called validhtml Inside that folder, create a file called index.html Use this basic html template to get your page started Inside the body section of the document write some text with a basic portfolio Upload the folder to your github repo (drag and drop it onto your repository) Use the w3c validator and make sure your the URL to your project validates Sections for resumeA short paragraph with a welcome message plus 4-6 sentences that include a short bio about yourself (see the example bio on my LinkedIn Learning page. SkillsAn unordered list of your skills. These would be something other than software skills. In LinkedIn, they appear in the Featured Skills and endorsements. For example the top skills on my LinkedIn profile are listed as: User Interface Design, User Experience, Web Development, CSS, JavaScript, etc. Please list at least ten skills…think of the skills you’ll be learning in this or other classes this semester. Software/HardwareThis is a list of the software and hardware you’re comfortable with. Don’t use specific version of software. If possible, try to make it specific to your career. If you’re going into graphic design, then perhaps Photoshop and InDesign might be something you’d list, for 3-D animation, perhaps Maya and for video, After Effects. At least five. Social Media/WebA list of links to your public social media profiles or other websites where people can find you; things like LinkedIn, Twitter, Youtube, etc. At the very least, you should link to your website address, and your github repo. If you’re a graphic designer, perhaps a link to Beehance. Work SamplesThese will be images to samples of previous work. If you’ve done some work for other classes, these will be a great place for them. If you don’t already have them online, upload them to your server like you did the photos and create links for them. At least 5 images. Expectations Use headlines (H1-H6) for headings Use paragraph tags for paragraphs Use br tags, but ONLY for breaking up single lines of text. DO NOT use this for formatting your document or adding extra vertical spacing. Convert text links to URLs using the anchor tag Convert links to work samples to images using the img tag. Use ordered and unordered lists where necessary. Use the strong tag to give strong importance to text. DO NOT use any tags not mentioned in this list. DO NOT use anything that will format or style the document in any way.","categories":[{"name":"assignments","slug":"assignments","permalink":"http://yoursite.com/fid/categories/assignments/"}],"tags":[{"name":"html","slug":"html","permalink":"http://yoursite.com/fid/tags/html/"},{"name":"week 02","slug":"week-02","permalink":"http://yoursite.com/fid/tags/week-02/"}]},{"title":"Create a Github Repository and Site","slug":"github-site","date":"2018-01-09T05:00:00.000Z","updated":"2018-01-09T22:54:12.494Z","comments":true,"path":"assignments/github-site/","link":"","permalink":"http://yoursite.com/fid/assignments/github-site/","excerpt":"For this assignment, you’ll simply create a Github Account and create your first Github issue in the class repo","text":"For this assignment, you’ll simply create a Github Account and create your first Github issue in the class repo Class Resources Slides Notes Online Resources Creating a new Repository Creating an Issue in Github Configuring Github Pages markdown syntax Information for Github IssueIn the issue you will include the following: A link to your public class Github Repository A link to your Github Pages site. A one or two sentence answer to each of the following questions (pretend you’re interviewing for a job in my company) What experience do you have building websites? What software experience do you currently have? What are some of your strongest soft skills (read this)? Where do you see yourself working after you complete your studies? Submitting the IssueCreate a README.md file on your site (help with markdown syntax). You’re welcome to use the same info in the issues or keep it simpler. Remember that Github as well as this class repo is a public website, so the issues will be public. You don’t have to put your name on these. You will submit a link to your Github Issue in canvas to complete this assignment.","categories":[{"name":"assignments","slug":"assignments","permalink":"http://yoursite.com/fid/categories/assignments/"}],"tags":[{"name":"week 01","slug":"week-01","permalink":"http://yoursite.com/fid/tags/week-01/"},{"name":"github","slug":"github","permalink":"http://yoursite.com/fid/tags/github/"}]},{"title":"Create a Lynda.com Account","slug":"lynda-com","date":"2018-01-09T05:00:00.000Z","updated":"2018-01-09T22:54:12.495Z","comments":true,"path":"assignments/lynda-com/","link":"","permalink":"http://yoursite.com/fid/assignments/lynda-com/","excerpt":"For this assignment you will create an account for lynda.com. It’s not a free account, but you can find it at some public libraries for free. Go to your public library and ask for a special code to receive a lynda.com account. They will give you further instructions to set this up.","text":"For this assignment you will create an account for lynda.com. It’s not a free account, but you can find it at some public libraries for free. Go to your public library and ask for a special code to receive a lynda.com account. They will give you further instructions to set this up. Seminole Library Osceola Library Orange Library Volusia Library Veterans How to use Lynda.com To submit this assignment, send me a screenshot of the lynda.com website once you’ve created and set up your lynda.com account. I should be able to see your name or account on the upper right hand site of the screenshot. Videos Taking a Screenshot on a PC Taking a Screenshot on a Mac","categories":[{"name":"assignments","slug":"assignments","permalink":"http://yoursite.com/fid/categories/assignments/"}],"tags":[{"name":"week 01","slug":"week-01","permalink":"http://yoursite.com/fid/tags/week-01/"},{"name":"lynda","slug":"lynda","permalink":"http://yoursite.com/fid/tags/lynda/"}]}]}